assets/ahmedBody/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
 =========                |
 \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
  \    /   O peration     | Website:  https://openfoam.org
   \  /    A nd           | Version:  14
    \/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-2.5  0.0002 -0.195)
    ( 3.5  0.0002 -0.195)
    ( 3.5  0.5 -0.195)
    (-2.5  0.5 -0.195)
    (-2.5  0.0002  0.3)
    ( 3.5  0.0002  0.3)
    ( 3.5  0.5  0.3)
    (-2.5  0.5  0.3)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (50 5 5) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    freestream
    {
        type patch;
        faces
        (
            (3 7 6 2)
            (1 5 4 0)
            (4 5 6 7)

        );
    }
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
    ground
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
    }
);

// ************************************************************************* //
