assets/ahmedBody/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#includeEtc "caseDicts/mesh/generation/snappyHexMeshDict.cfg"

castellatedMesh on;
snap            on;
addLayers       on;

geometry
{

    ahmedBody
    {
        type triSurface;
        file "ahmedBody.stl";
        name ahmedBody;
        regions
        {
            body //name of STL 'solid'
            {
                name body; // name used in SHM (patch name on final mesh)
            }
            legs
            {
                name legs;
            }
        }
    }

    // Analytical shape; cylinder, sphere
    refinementBox
    {
        type box;
        min (-0.2 0.0 -0.195);
        max (1.3 0.3 0.2 );
    }
};

// Settings for the castellatedMesh generation.
castellatedMeshControls
{

    // Refinement parameters
    // ~~~~~~~~~~~~~~~~~~~~~

    maxLocalCells 100000;

    maxGlobalCells 2000000;

    minRefinementCells 10;

    maxLoadUnbalance 0.10;

    nCellsBetweenLevels 3;


    features
    (
        {
            file "ahmedBody.eMesh";
            level 4;
        }

    );

    refinementSurfaces
    {
        ahmedBody
        {
            level (0 0);

            regions
            {

                body
                {
                    level (3 4);
                    patchInfo
                    {
                        type wall;
                        inGroups (walls);
                    }
                }

                legs
                {
                    level (4 5);
                    patchInfo
                    {
                        type wall;
                        inGroups (walls);
                    }
                }
            }
        }
    }

    // Resolve sharp angles
    //resolveFeatureAngle 10;

    refinementRegions
    {
        refinementBox
        {
            mode inside;
            level     3;
        }
    }

    insidePoint (-0.4 0.1 0.0);
    nCellsBetweenLevels 5;
}


// Settings for the snapping.
snapControls
{
    nSmoothPatch 2;

    // relative to cell size
    tolerance 2.0;

    //- Number of mesh displacement relaxation iterations.
    nSolveIter 30;

    //- Maximum number of snapping relaxation iterations. Should stop
    //  before upon reaching a correct mesh.
    nRelaxIter 5;

    // Feature snapping

    //- Number of feature edge snapping iterations.
    //  Leave out altogether to disable.
    nFeatureSnapIter 10;

    //- Detect (geometric only) features by sampling the surface
    //  (default=false).
    implicitFeatureSnap false;

    //- Use castellatedMeshControls::features (default = true)
    explicitFeatureSnap true;

    //- Detect points on multiple surfaces (only for explicitFeatureSnap)
    multiRegionFeatureSnap false;
}


addLayersControls
{
    layers
    {
        body
        {
            nSurfaceLayers 3;
        }
        legs
        {
            nSurfaceLayers 3;
        }
    }

    relativeSizes       on;
    expansionRatio      1.2;
    finalLayerThickness 0.5;
    minThickness        1e-3;
    maxThicknessToMedialRatio 0.6;
}

writeFlags
(
    scalarLevels
    layerFields
);

mergeTolerance 1e-6;

// ************************************************************************* //
