assets/ahmedBody/0.orig/U.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "${FOAM_CASE}/constant/caseSettings"

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform $flowVelocity;

boundaryField
{
    inlet 
    {
        type            fixedValue;
        value           unifor ($flowVelocity 0 0);
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
    }

    ground
    {
        $inlet;
    }

    "(body|legs)"
    {
        type            noSlip;
    }

    freestream
    {
        type            freestreamVelocity;
        freestreamValue uniform ($flowVelocity 0 0);
    }

    processor
    {
        type            processor;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
